andersenthomas98/masteroppgave/nrf5sdk_thread/examples/multiprotocol/experimental/ble_zigbee_dynamic_template/main.c
    /* YOUR_JOB: Handle stack signals relevant to your application. */
    NRF_LOG_INFO("Zigbee signal received (signal: %u, status: %d)", sig, status);

    /* Update network status LED */
    zigbee_led_status_update(bufid, ZIGBEE_NETWORK_STATE_LED);

    switch (sig)
    {
        default:
            /* Call default signal handler. */
            ZB_ERROR_CHECK(zigbee_default_signal_handler(bufid));
            break;
    }

    if (bufid)
    {
        zb_buf_free(bufid);
    }
}

/***************************************************************************************************
 * @section Main
 **************************************************************************************************/

/**@brief Function for application main entry.
 */
int main(void)
{
    zb_ret_t zb_err_code;
    bool erase_bonds;

    // Initialize.
    log_init();
    scheduler_init();
    timers_init();
    buttons_leds_init(&erase_bonds);
    ble_stack_init();
    gap_params_init();
    gatt_init();
    advertising_init();
    services_init();
    conn_params_init();
    peer_manager_init();

    // Start execution.
    NRF_LOG_INFO("BLE Zigbee template example started.");
    application_timers_start();

    zigbee_init();

    /** Start Zigbee Stack. */
    zb_err_code = zboss_start_no_autostart();
    ZB_ERROR_CHECK(zb_err_code);

    advertising_start(erase_bonds);

    // Enter main loop.
    while (true)
    {
        zboss_main_loop_iteration();
        UNUSED_RETURN_VALUE(NRF_LOG_PROCESS());
        app_sched_execute();
    }
}


/**
 * @}
 */
